## 如何讓兩個list 相乘

In [9]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

# method 1
for i in range(0, len(a)):
    print(a[i] * b[i])

# method 2
ary = []
for i in range(0, len(a)):
    ary.append(a[i] * b[i])
print(ary)

# method 3
print([a[i] * b[i] for i in range(0, len(a))])

# method 4: zip
for f, s in zip(a, b):
    print(f * s)

# method 5
print([f * s for f,s in zip(a,b)])

2
12
30
56
90
[2, 12, 30, 56, 90]
[2, 12, 30, 56, 90]
2
12
30
56
90
[2, 12, 30, 56, 90]

## 在104 的爬蟲套用zip

In [14]:
import requests
res = requests.get('https://www.104.com.tw/jobbank/custjob/index.php?r=cust&j=623e466f383a426b34363e673c423a1d02d2d2d70463a4e2644j50')
res.encoding = 'utf-8'
#print(res.encoding)

In [18]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'html.parser')
tag = soup.select('dt')
description = soup.select('dd')
for t, d in zip(tag, description):
    print(t.text,d.text.strip())

產業類別： 電腦軟體服務業
產業描述： 資訊軟體
員　　工： 10人
資 本 額： 200萬元
聯 絡 人： 丘先生
公司地址： 台北市中山區南京東路二段地圖
電　　話： 暫不提供
傳　　真： 暫不提供
公司網址： http://www.largitdata.com
相關連結： 更多





商業司登記
Google查公司名稱
求職服務專線 02-2912-6104 轉2
廠商求才專線

## Numpy

In [24]:
import numpy as np
na = np.array(a)
nb = np.array(b)
na * nb
na + nb
na - nb
na / nb

array([ 0.5       ,  0.75      ,  0.83333333,  0.875     ,  0.9       ])

## Numpy 1d array

In [32]:
a = [1,2,3,4,5]
print(type(a))

na = np.array(a)
print(type(na))

na[0]
na[1:3]

print(na >= 3)
print(na[na >= 3])

<class 'list'>
<class 'numpy.ndarray'>
[False False  True  True  True]
[3 4 5]

## Numpy 2d array

In [38]:
na = np.array([[1,2,3,4,5],[6,7,8,9,10]])
print(type(na))
print(na)
print(na[0,0])
print(na[0,:])
print(na[:,0])
print(na.T)

<class 'numpy.ndarray'>
[[ 1  2  3  4  5]
 [ 6  7  8  9 10]]
1
[1 2 3 4 5]
[1 6]
[[ 1  6]
 [ 2  7]
 [ 3  8]
 [ 4  9]
 [ 5 10]]

In [39]:
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U5')

## Pandas

In [41]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [42]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [43]:
df.columns = ['name', 'gender', 'age']

In [46]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

## Pandas Series

In [47]:
import pandas as pd
s= pd.Series([21000,18900,18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [48]:
s[1]

18900

In [52]:
s = pd.Series([21000, 18900, 18000], index = ['Iphone', 'Edge S7', 'HTC M1'])
print(s)
print(s['Iphone'])

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64
21000

In [55]:
dic = {
'Iphone':21000,
'Edge S7':18900,
'HTC M1':18000
}

s = pd.Series(dic)

In [59]:
print(s)
print(s[2])

Edge S7    18900
HTC M1     18000
Iphone     21000
dtype: int64
21000

In [60]:
print(s[1:3])

HTC M1    18000
Iphone    21000
dtype: int64

In [61]:
s['Iphone']

21000

In [62]:
s[['Iphone', 'HTC M1']]

Iphone    21000
HTC M1    18000
dtype: int64

In [66]:
s < 20000

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [65]:
s[s < 20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [69]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [70]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [72]:
print(s['Iphone'])
s['Iphone'] = 20000
print(s['Iphone'])

21000
20000

In [75]:
s[s<20000] = s[s< 20000] * 0.8

In [76]:
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [77]:
'Iphone' in s

True

In [78]:
'mi' in s

False

In [80]:
s * 0.8

Edge S7    12096.0
HTC M1     11520.0
Iphone     16000.0
dtype: float64

In [82]:
import numpy as np
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
Iphone     141.421356
dtype: float64

In [86]:
s
print(s.max())
print(s.mean())
print(s.describe())

20000
16506.666666666668
count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [89]:
s[['Iphone', 'HTC M1']]

Iphone    20000
HTC M1    14400
dtype: int64

In [91]:
s[['mi', 'HTC M1']]

mi            NaN
HTC M1    14400.0
dtype: float64

In [93]:
s2 = s[['Iphone', 'HTC M1']] + s[['mi', 'HTC M1']]

In [95]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [96]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [97]:
s2[s2.notnull()]

HTC M1    28800.0
dtype: float64

In [108]:
s = pd.Series(['Apple', 'Bananna', 'Cat'])

0      Apple
1    Bananna
2        Cat
dtype: object

In [121]:
def getApple(e):
    return 'Apple' in e

s[s.map(getApple)]

0    Apple
dtype: object

In [122]:
s[s.map(lambda e: 'Apple' in e)]

0    Apple
dtype: object

In [117]:
def square(e):
    return e * e

square(2)

4

In [118]:
square2 = lambda e : e * e
square2(3)

9

In [112]:
# contains => 檢查理面是否包含a
s[s.str.contains('a')]

1    Bananna
2        Cat
dtype: object

In [116]:
# match => 使用正規表達法檢查理面是否有比對到a的樣式
s[s.str.match('.*?a.*?')]

1    Bananna
2        Cat
dtype: object

In [110]:
s[s.map(lambda e: 'a' in e.lower())]

0      Apple
1    Bananna
2        Cat
dtype: object

## Pandas DataFrame

In [123]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [124]:
df.columns = ['name', 'gender', 'age']

In [125]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [126]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]]\
                  , columns = ['name', 'gender', 'age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [127]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [130]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23, 'marriage': 'yes'}, \
                   {'name':'tom',   'gender':'M', 'age':35}])
df

   age gender marriage   name
0   29      M      NaN  frank
1   23      F      yes   mary
2   35      M      NaN    tom

## 整理三大法人交易資料

In [134]:
import requests
res = requests.get('http://www.twse.com.tw/fund/BFI82U?response=json&dayDate=&weekDate=&monthDate=&type=day&_=1503112639075')
df = pd.DataFrame(res.json()['data'])
df

           0               1               2               3
0  自營商(自行買賣)   1,025,069,400     850,792,577     174,276,823
1    自營商(避險)   4,591,078,711   4,949,618,576    -358,539,865
2         投信     703,309,860     869,642,577    -166,332,717
3      外資及陸資  18,946,611,191  23,751,447,432  -4,804,836,241
4         合計  25,266,069,162  30,421,501,162  -5,155,432,000

## 操作DataFrame

In [135]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [136]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [137]:
df.tail()

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [139]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [141]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [142]:
df.ix[1]

age         23
gender       F
name      mary
Name: 1, dtype: object

In [143]:
df.ix[1:4]

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean

In [144]:
df.ix[ : , ['name', 'gender'] ]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [145]:
df.ix[   0:3 ,  :  ]

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted

In [146]:
# series
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [149]:
df['name'].to_frame()

    name
0  frank
1   mary
2    tom
3    ted
4   jean
5   lisa

In [147]:
# dataframe
df[['name', 'gender']]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [150]:
df.ix[1:2, ['name', 'gender']]

   name gender
1  mary      F
2   tom      M